РазработкаОУМобильная/src/BusinessProcesses/УГМК_Плавка/УГМК_Плавка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>УГМК_Плавка</name>
  <task>Task.УГМК_Задача</task>
  <attributes>
    <name>НомерПечи</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПлавки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПлавки</name>
    <type>
      <types>DocumentRef.УГМК_ДокументФакт</types>
    </type>
  </attributes>
  <attributes>
    <name>КлючПлавки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>6</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДляПоиска</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДляПредставления</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РабочийЦентр</name>
    <type>
      <types>CatalogRef.РабочиеЦентры</types>
    </type>
  </attributes>
  <attributes>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <comment>(Регл)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Основная</name>
    <type>
      <types>BusinessProcessRef.УГМК_Плавка</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_Временный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДокументыБП</name>
    <attributes>
      <name>Документ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УГМК_Реквизит1</name>
      <type>
        <types>Characteristic.СвойстваОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>УГМК_Реквизит2</name>
      <type>
        <types>Characteristic.СвойстваОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>УГМК_Реквизит3</name>
      <type>
        <types>Characteristic.СвойстваОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>УГМК_Реквизит4</name>
      <type>
        <types>Characteristic.СвойстваОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>УГМК_Реквизит5</name>
      <type>
        <types>Characteristic.СвойстваОбъектов</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:BusinessProcess>

РазработкаОУМобильная/src/Catalogs/СерииНоменклатуры/СерииНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СерииНоменклатуры</name>
  <owners>Catalog.Номенклатура</owners>
  <attributes>
    <name>СерийныйНомер</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокГодности</name>
    <comment>(Общ)</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерГТД</name>
    <comment>(Регл) Номер ГТД по умолчанию</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <comment>(Регл)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеИзображение</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_СвободноеНаличие</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ПаспортПартии</name>
    <type>
      <types>BusinessProcessRef.УГМК_ПаспортПартии</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_ДокументОприходования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_Упаковка</name>
    <type>
      <types>DocumentRef.УГМК_Упаковка</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УГМК_Плавки</name>
    <attributes>
      <name>Плавка</name>
      <type>
        <types>String</types>
        <types>BusinessProcessRef.УГМК_Плавка</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерСлитка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

РазработкаОУМобильная/src/BusinessProcesses/УГМК_Плавка/ObjectModule.bsl
Процедура ОбновитьКлючПлавки() Экспорт
	КлючПлавки = Формат( НомерПечи, "ЧЦ=2; ЧН=00; ЧВН=")+"-"+Формат( НомерПлавки, "ЧЦ=3; ЧН=000; ЧВН=");
КонецПроцедуры
	
Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка  Тогда
		Возврат;
	КонецЕсли;
	
	//СтруктураОбязательныхПолей = Новый Структура("НомерПлавки");
	//
	//Заголовок = Строка( ЭтотОбъект);
	//
	//ЗаполнениеДокументов.ПроверитьЗаполнениеШапкиДокумента(ЭтотОбъект, СтруктураОбязательныхПолей, Отказ, Заголовок);
	
КонецПроцедуры

Функция ПолучитьСледующийНомерПлавки( ДляПечи, ТекСсылка) Экспорт
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("НомерПечи", ДляПечи);
	Запр.УстановитьПараметр("Ссылка", ТекСсылка);
	Запр.Текст = "ВЫБРАТЬ
	             |	ЕстьNull( МАКСИМУМ(УГМК_Плавка.НомерПлавки), -1) КАК НомерПлавки
	             |ИЗ
	             |	БизнесПроцесс.УГМК_Плавка КАК УГМК_Плавка
	             |ГДЕ
	             |	УГМК_Плавка.НомерПечи = &НомерПечи
	             |	И УГМК_Плавка.Ссылка <> &Ссылка";
	Результат = Запр.Выполнить().Выбрать();
	СледующийНомер = 0;
	Если Результат.Следующий() тогда
		СледующийНомер = Результат.НомерПлавки+1;
		Если СледующийНомер = 1000 тогда
			СледующийНомер = 0;
		КонецЕсли;
	КонецЕсли;
	
	Возврат( СледующийНомер);
КонецФункции

Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПереименоватьСерии() Экспорт
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Плавка", Ссылка);
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	СерииНоменклатурыПлавки.Ссылка,
	             |	СерииНоменклатурыПлавки.Ссылка.Наименование
	             |ИЗ
	             |	Справочник.СерииНоменклатуры.УГМК_Плавки КАК СерииНоменклатурыПлавки
	             |ГДЕ
	             |	СерииНоменклатурыПлавки.Плавка = &Плавка";
	Результат = Запр.Выполнить().Выбрать();
	Пока Результат.Следующий() цикл
		Объект = Результат.Ссылка.ПолучитьОбъект();
		НовоеНаименование = УГМК_СлужебныеФункции.СформироватьНаименованиеПоПлавкам( Объект.УГМК_Плавки);
		Если Результат.Наименование <> НовоеНаименование тогда
			Объект.Наименование = НовоеНаименование;
			Объект.Записать();
			
			Сообщить("Обновлена серия "+Объект.Владелец+" ["+Объект.Код+"] "+Объект.Наименование);
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьПлавкуУСерии( СерияНоменклатуры, СсылкаБП) Экспорт
	Объект = СерияНоменклатуры.ПолучитьОбъект();
	СтрокаПлавки = Объект.УГМК_Плавки.Найти( СсылкаБП, "Плавка");
	Если СтрокаПлавки = Неопределено тогда
		Стр = Объект.Наименование;
		
		СтрокаПлавки = Объект.УГМК_Плавки.Добавить();
		СтрокаПлавки.Плавка = СсылкаБП;
		Объект.Наименование = УГМК_СлужебныеФункции.СформироватьНаименованиеПоПлавкам( Объект.УГМК_Плавки);
		Объект.Записать();
		
		Сообщить("Обновлена серия "+Объект.Владелец+" ["+Объект.Код+"] "+Объект.Наименование);
	КонецЕсли;
КонецПроцедуры
